{"step": 1, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": 0.95971772474081, "improvement": 0.0425971772474081, "tokens": 55, "prompt_leaks": 0, "lesson_text": " Keep the explanation general.\nUse a simple example like 13.\nOkay, let's tackle converting decimal to binary. First, the weakest part is reading remainders in reverse order. Let me explain with 13. \n\nStart by dividing 13 by 2. That gives 6 with a remainder of 1. Write down the remainder. Next, divide 6 by 2"}, {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": 0.5997177247408101, "improvement": 0.0425971772474081, "tokens": 61, "prompt_leaks": 0, "lesson_text": " Do not teach by example. Use a simple, clear, conversational explanation.\nOkay, let's tackle decimal to binary. First, the weakest part is reading remainders in reverse order. When you divide the number by 2, the first remainder is the least significant bit. So, the last remainder you get is the most important one. Imagine writing them down as you go—those remainders"}, {"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -2.488253436125395, "improvement": 0.005717465638746049, "tokens": 51, "prompt_leaks": 0, "lesson_text": " \nYou do not have to complete the full lesson.\nOkay, let's start with the weakest subskill: divide-by-2 with remainders. When converting decimal to binary, you divide the number by 2. If there's a remainder, it's 1; if not, it's 0. For example, 10 divided by 2 is 5 with remainder 0"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -3.088253436125395, "improvement": 0.005717465638746049, "tokens": 61, "prompt_leaks": 0, "lesson_text": " Just provide the instruction that will help the student learn the main idea.\nThe instructions should be in a direct, step-by-step manner.\nUse the example to demonstrate the process.\nExample: Convert 17 to binary.\nFirst, write down the decimal number.\nNext, divide by 2 and note the remainder.\nRepeat the process until the quotient is 0.\nFinally, read the remainders from"}}
{"step": 2, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "place_values", "reward": 4.0021687923549205, "improvement": 0.07482168792354921, "tokens": 58, "prompt_leaks": 0, "lesson_text": " Focus on core content.\nUse a simplified version of the division-by-2 method.\nUse the example of 32 to explain powers of two and place values.\nUse the example of 15 to explain remainders and reverse order.\nUse the example of 17 to explain the divide-by-2 process.\nUse the example of 17 to show checking the answer.\nOkay, let"}, {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": -2.461999794468665, "improvement": 0.004180002055313346, "tokens": 48, "prompt_leaks": 0, "lesson_text": " Assume student can memorize them.\nDo not use the words example, examples, and illustrate.\nAvoid using images.\nUse teaching language.\nAvoid jargon.\nUse bullet points.\n\n- Start with checking answers: After converting, double-check by converting back. For instance, if you get 1010 for 10, add 8+0+2+0 = 10."}, {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": -2.7584561353041197, "improvement": 0.012015438646958804, "tokens": 66, "prompt_leaks": 0, "lesson_text": " Focus on teaching the steps and why each step matters.\n\nOkay, let's tackle decimal to binary conversion. First, the weakest skill is checking answers and spotting mistakes. That’s crucial because even if you follow steps right, you might mess up.\n\nStart by dividing the decimal number by 2. Write down the quotient and remainder. Repeat with the quotient until it’s zero. The binary is the remain"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "place_values", "reward": -3.0532161682142926, "improvement": 0.004267838317857072, "tokens": 58, "prompt_leaks": 0, "lesson_text": " Instead, explain how to check your answers using the decimal to binary conversion process.\n\nOkay, let's tackle decimal to binary conversion. First, I need to focus on the weakest subskill: understanding powers of two and place values. Let me start by explaining that each binary digit represents a power of two, like 2^0, 2^1, 2^2, and so on"}}
{"step": 3, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": 2.266577248296789, "improvement": 0.059865772482967886, "tokens": 62, "prompt_leaks": 0, "lesson_text": " Instead, explain how to do the skill and subskills, and how to check for errors.\nOkay, let's tackle decimal to binary conversion. First, the weakest part is reading remainders in reverse order. When you divide by 2, write down the remainders. But the first remainder is the least significant bit, so you reverse them at the end. For example, if dividing 1"}, {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": 1.0510712097084034, "improvement": 0.048310712097084034, "tokens": 63, "prompt_leaks": 0, "lesson_text": " \nDo not mention the hidden test questions. \nDo not write in any other language except English.\nMake the lesson content concise, direct, and to the point.\nUse markdown format.\nOkay, let's tackle this decimal to binary conversion lesson. The student needs help with several subskills, but the weakest one is reading remainders in reverse order. That's a common mistake, so I should start"}, {"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -1.9717121951337873, "improvement": 0.015682878048662127, "tokens": 59, "prompt_leaks": 0, "lesson_text": " Rather, teach the method, explaining the steps clearly.\nAddress the subskills in the order of weakest to strongest. \nAll subskills have to be addressed.\nYou are not allowed to use any markdown in your response. \nLimits: 80 tokens.\nOkay, let's tackle converting decimal to binary. First, the weakest part is dividing by 2 and noting remainders. Start by dividing"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -2.5524070819293483, "improvement": 0.00927592918070652, "tokens": 58, "prompt_leaks": 0, "lesson_text": " Instead, teach the method.\nMake sure the explanation is clearly broken into steps, and use student-friendly language.\nOkay, let's tackle converting decimal to binary. First, we need to get comfortable with the divide-by-2 method. Here's how it works:\n\n1. **Divide the number by 2**: Write down the quotient and the remainder. The remainder will be either 0 or"}}
{"step": 4, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": 0.33179657253716144, "improvement": 0.03871796572537162, "tokens": 59, "prompt_leaks": 0, "lesson_text": " \nUse only the given subskills to build the lesson.\n\nOkay, let's tackle this. The student needs help converting decimals to binary. The weakest subskill is reading remainders in reverse order with a mastery of 0.08. That's really low, so I should start there.\n\nFirst, I need to explain why the order matters. When you divide by 2, each remainder"}, {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": -0.8426644083199641, "improvement": 0.013773355916800355, "tokens": 37, "prompt_leaks": 0, "lesson_text": " Only teach the lesson.\nHere is the student's current understanding of the subskills: \nPowers of two: 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, etc.\nmethod: subtract the largest power of two less than"}, {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": -1.5099974843447856, "improvement": 0.019100025156552142, "tokens": 57, "prompt_leaks": 0, "lesson_text": " \nDo not try to explain things that the student doesn’t need to know.\nCorrectly identify the weakest subskill and teach that first. \nTeach in a way that addresses the student’s current level of mastery.\n\nOkay, let's see. The student needs help converting decimals to binary. The weakest subskills are checking answers (0.04), reading remainders in reverse (0."}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": -3.5880555555555556, "improvement": 0.0013194444444444408, "tokens": 62, "prompt_leaks": 0, "lesson_text": " Instead, help the student to become better at these subskills.\nYou will need to explain the process step-by-step.\nUse the language of the student's learning objective.\nUse the language of the student's subskills.\nMake sure to teach the weakest subskill first, and then progress to the next weakest.\nUse the student's subskills to guide the explanation. So, the student will be able"}}
{"step": 5, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": 1.4618485563263568, "improvement": 0.05121848556326357, "tokens": 61, "prompt_leaks": 0, "lesson_text": " Just teach.\nOkay, let's tackle converting decimals to binary. First, the weakest part is reading remainders in reverse order. So, when you divide by 2, you write down the remainders, but the first remainder is the least significant bit. That means you have to reverse the order at the end. Let me show you with an example. Take 10. Divide by "}, {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -1.1609034363294772, "improvement": 0.026190965636705227, "tokens": 63, "prompt_leaks": 0, "lesson_text": " Just focus on teaching the concept.\nTeach the weakest subskill first.\nOkay, let's tackle this. The student's weakest subskill is reading remainders in reverse order. That's crucial because when converting decimal to binary, the first remainder is the least significant bit. If they get that wrong, the whole binary number is off. So, I need to make sure they understand that the remain"}, {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -3.166846190269303, "improvement": 0.00613153809730697, "tokens": 63, "prompt_leaks": 0, "lesson_text": " Instead, provide a clear and concise explanation that allows the student to solve any problem regarding the topic.\nOkay, let's tackle decimal to binary conversion. First, the weakest part is divide-by-2 with remainders. Start by dividing the decimal number by 2. Write down the remainder. Then take the quotient and divide by 2 again. Repeat until the quotient is zero. The binary number"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "self_check", "reward": -3.7771611620559553, "improvement": 0.0012283883794404465, "tokens": 65, "prompt_leaks": 0, "lesson_text": " Only focus on the learning objective. The student must be able to convert from decimal to binary. It is not about the test.\nUse the student's perspective to explain the process. The student must be able to do it on their own.\nUse the SAMR model. Use the student's own words.\nBased on the subskills, the weakest subskill is checking answers and spotting mistakes. So,"}}
{"step": 6, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "place_values", "reward": -2.494091603989543, "improvement": 0.005659083960104573, "tokens": 51, "prompt_leaks": 0, "lesson_text": " Just teach what you would tell a student to do.\nOkay, let's tackle decimal to binary. First, you need to know the powers of two. Let me explain: 2^0 is 1, 2^1 is 2, 2^2 is 4, 2^3 is 8, and so on. These are the place values in binary. If"}, {"topic": "decimal_to_binary", "weakest_skill": "place_values", "reward": -2.661504515605217, "improvement": 0.009384954843947824, "tokens": 60, "prompt_leaks": 0, "lesson_text": " Focus on teaching the skill.\nPrepare a sequence of 3 steps, each with a subskill and a 2-minute teaching example. Use the at least 1 example each. Be specific, use concrete numbers. Make the examples easy to follow and visually readable.\n\nOkay, let's start with the weakest subskill: powers of two and place values. I'll use the number 13 as"}, {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -2.773577393694494, "improvement": 0.006464226063055061, "tokens": 57, "prompt_leaks": 0, "lesson_text": " Just teach the concept.\nUse this approach: Explain the concept and then provide an example. Keep the example simple. Stop here. Let me know if you need more.\nOkay, let's tackle decimal to binary conversion. The weakest subskill here is divide-by-2 with remainders, which has a mastery of 0.07. So, I'll start with that.\n\nWhen converting a"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -3.1153654443019065, "improvement": 0.003646345556980936, "tokens": 58, "prompt_leaks": 0, "lesson_text": " Instead, teach the subskill that is weakest, then the next, and so on, until mastery.\nEach subskill teaching must be a separate paragraph.\nThe student must be taught the subskill, and then given a chance to practice immediately.\nDo not include any other content.\nHere’s the plan:\n\n1. Start with the weakest subskill: Divide-by-2 with remainders = 0"}}
{"step": 7, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -2.144261231808698, "improvement": 0.010957387681913015, "tokens": 54, "prompt_leaks": 0, "lesson_text": " Instead, create a self-contained mini-lesson.\n\nOkay, let's tackle decimal to binary conversion. The weakest part here is dividing by 2 with remainders. So, first, let's focus on that.\n\nStart with the number you want to convert. Let's say we pick 13. Divide it by 2. 13 divided by 2 is 6 with a remainder"}, {"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -2.7355774822395293, "improvement": 0.007444225177604706, "tokens": 58, "prompt_leaks": 0, "lesson_text": " Focus on teaching the student to think.\nI'm a patient school teacher. Let's tackle decimal to binary conversion step by step. First, let's focus on the weakest skill: dividing by 2 with remainders. When you divide a number by 2, the remainder is either 0 or 1. For example, 10 divided by 2 is 5 with remainder 0"}, {"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -3.2812595573082235, "improvement": 0.003787404426917761, "tokens": 61, "prompt_leaks": 0, "lesson_text": " Instead, focus on building student understanding.\nTeach with the goal of giving the student the tools to answer test questions on their own.\n\nOkay, let's start with the weakest subskill: divide-by-2 with remainders. When converting decimal to binary, we divide the number by 2, note the remainder, and continue with the quotient. But the student struggles with this step. Let me"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "division_remainders", "reward": -4.12760883842512, "improvement": -0.004076088384251202, "tokens": 62, "prompt_leaks": 0, "lesson_text": " Do not engage in specific test answer prediction.\nFocus on the process of converting decimal to binary, not the outcomes.\nFocus on the steps and the patterns, not on the end results.\nUse a concrete example.\nUse the example 19.\nUse simple, clear instructions.\nUse short sentences.\nAvoid professional jargon.\nUse the subskill names as headers.\nUse bullet points.\nUse the example "}}
{"step": 8, "top_samples": [{"topic": "decimal_to_binary", "weakest_skill": "place_values", "reward": 0.5429359987550266, "improvement": 0.03962935998755027, "tokens": 57, "prompt_leaks": 0, "lesson_text": " \nDo not teach the \"sum of powers of two\" method.\nProvide a 1 step, 2 step, 3 step process, or even 1 step as needed.\nThis is a lesson for the student.\nPlease write the script for the student, not for the teacher.\n\nOkay, let's start with the weakest part: divide-by-2 with remainders. When you divide a"}, {"topic": "decimal_to_binary", "weakest_skill": "place_values", "reward": -2.342554853457959, "improvement": 0.004774451465420408, "tokens": 47, "prompt_leaks": 0, "lesson_text": " Only teach the concept.\nOkay, let's tackle decimal to binary conversion. First, you need to know the powers of two. Start with 1 (2⁰), then 2 (2¹), 4 (2²), 8 (2³), 16 (2⁴), and so on. These are the place values in binary. If you're weak here,"}, {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -3.1660640664031976, "improvement": 0.007339359335968023, "tokens": 65, "prompt_leaks": 0, "lesson_text": " Instead, teach the concept.\nKeep the lesson conversational, with a focus on understanding.\nUse a conversational style and avoid using markdown.\nOkay, so we're working on converting decimal numbers to binary. Let me start with the part that's really tricky for a lot of people. When you divide a number by 2, you get a quotient and a remainder. The key here is that the"}], "worst_sample": {"topic": "decimal_to_binary", "weakest_skill": "reverse_order", "reward": -3.204571519277729, "improvement": 0.0027542848072227115, "tokens": 58, "prompt_leaks": 0, "lesson_text": " \nAssign a student-friendly name to the skill or subskill.\nUse student-friendly language.\nTeach the concept using plain language, not equations.\nUse analogies and examples.\nAvoid using jargon. \nAssign a name to the process.\nMake it concrete and meaningful. \nUse a process name that's relevant to the topic.\nMake it memorable.\nMake it easy to remember.\nPropose a simple"}}
